# Homebrew packages
# Install with: brew bundle

# Core tools
brew "git"
brew "curl"
brew "wget"

# Kubernetes tools
brew "kubectl"
brew "kustomize"
brew "helm"

# Development tools
brew "docker"
brew "docker-compose"

# Cloud tools
brew "terraform"
brew "ansible"

# Utilities
brew "jq"
brew "yq"
brew "tree"
brew "htop"
brew "fzf"

# Optional: Uncomment to install
# brew "node"
# brew "python@3.11"
# brew "go"

